cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'vitorgalvao/tiny-scripts'

# Tools
brew 'git'
brew 'node'
brew 'npm'
brew 'imagemagick'
brew 'mas'
brew 'python'
brew 'rbenv'
brew 'youtube-dl'

# Non-MAS apps
cask '1password'
cask 'alfred'
cask 'balsamiq-mockups'
cask 'bartender'
cask 'base'
cask 'bettertouchtool'
cask 'boom'
cask 'cloak'
cask 'daisydisk'
cask 'dash'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'kaleidoscope'
cask 'mailmate'
cask 'marked'
cask 'nvalt'
cask 'omnigraffle'
cask 'sonos'
cask 'spotify'
cask 'sublime-text'
cask 'vlc'
cask 'ynab'

# quicklook plugins (https://github.com/sindresorhus/quick-look-plugins)
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'betterzipql'
cask 'suspicious-package'

# fonts
cask 'font-source-sans-pro'
cask 'font-source-code-pro'
cask 'font-montserrat'
cask 'font-lato'

# MAS apps
mas signin --dialog <email 1>
mas 'Annotate', id: 918207447
mas 'Browser Fairy', id: 483014855
mas 'Day One', id: 1055511498
mas 'Due', id: 524373870
mas 'Fission', id: 549251391
mas 'Kindle', id: 405399194
mas 'Logic Pro X', id: 634148309
mas 'NepTunes', id: 1006739057
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pixelmator', id: 407963104
mas 'Simplenote', id: 692867256
mas 'Ulysses', id: 623795237
mas 'iThoughtsX', id: 720669838

# Sign in using 3rd Apple account
mas signin --dialog <email 2>
mas 'Fantastical 2', id: 975937182
mas 'OmniFocus', id: 867299399
mas 'Deckset', id: 847496013
mas 'Keynote', id: 409183694

# Sign in using 3rd Apple account
mas signin --dialog <email 3>
mas 'Napkin', id: 581789185
