cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'vitorgalvao/tiny-scripts'

# Tools
brew 'ffmpeg'
brew 'git'
brew 'hh'
brew 'node'
brew 'npm'
brew 'imagemagick'
brew 'mas'
brew 'python'
brew 'rbenv'
brew 'youtube-dl'
brew 'duti'

# Non-MAS apps
cask '1password'
cask 'alfred'
cask 'balsamiq-mockups'
cask 'bartender'
cask 'base'
cask 'bettertouchtool'
cask 'boom'
cask 'cloak'
cask 'daisydisk'
cask 'dash'
cask 'dropbox'
cask 'hazel'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'little-snitch'
cask 'kaleidoscope'
cask 'mailmate'
cask 'marked'
cask 'nvalt'
cask 'omnigraffle'
cask 'sonos'
cask 'spotify'
cask 'sublime-text'
cask 'vlc'
cask 'ynab'

# quicklook plugins (https://github.com/sindresorhus/quick-look-plugins)
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'betterzipql'
cask 'suspicious-package'

# fonts
cask 'font-source-sans-pro'
cask 'font-source-code-pro'
cask 'font-montserrat'
cask 'font-lato'


brew 'bash-completion'
tap 'homebrew/completions'
