cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'vitorgalvao/tiny-scripts'
brew 'ack'
brew 'aspell'
brew 'autojump'
brew 'broot'
brew 'coreutils'
brew 'dos2unix'
brew 'duti'
brew 'exa'
brew 'exiftool'
brew 'fd'
brew 'ffmpeg'
brew 'findutils'
brew 'fish'
brew 'git'
brew 'gnupg'
brew 'helm'
brew 'hstr'
brew 'httpie'
brew 'imagemagick'
brew 'jq'
brew 'kubectx'
brew 'mas'
brew 'micro'
brew 'nnn'
brew 'node'
brew 'p7zip'
brew 'pandoc'
brew 'poppler'
brew 'pdfgrep'
brew 'pgcli'
brew 'pwgen'
brew 'python'
brew 'python@2', link: false
brew 'rbenv'
brew 'ripgrep'
brew 'sd'
brew 'starship'
brew 'telnet'
brew 'terraform@0.11'
brew 'thefuck'
brew 'unrar'
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'zoxide'
brew 'zsh'
brew 'blendle/blendle/kns'
brew 'datawire/blackbird/telepresence'
brew 'lightbend/tools/reactive-cli'
brew 'olafurpg/scalafmt/scalafmt', args: ['HEAD']
cask '1password'
cask 'alfred'
cask 'bartender'
cask 'bettertouchtool'
cask 'daisydisk'
cask 'firefox'
cask 'font-jetbrains-mono'
cask 'font-lato'
cask 'font-poppins'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'gnucash'
cask 'hazel'
cask 'iina'
cask 'iterm2'
cask 'java'
cask 'kaleidoscope'
cask 'marked'
cask 'omnigraffle'
cask 'pycharm-ce'
cask 'setapp'
cask 'sourcetree'
cask 'spotify'
cask 'steam'
cask 'textexpander'
cask 'tuxguitar'
mas 'Annotate', id: 918207447
mas 'Bear', id: 1091189122
mas 'Better', id: 1121192229
mas 'Browser Fairy', id: 483014855
mas 'Day One', id: 1055511498
mas 'Drafts', id: 1435957248
mas 'Due', id: 524373870
mas 'Fantastical', id: 975937182
mas 'Fission', id: 549251391
mas 'iMovie', id: 408981434
mas 'iThoughtsX', id: 720669838
mas 'Keynote', id: 409183694
mas 'Kindle', id: 405399194
mas 'Logic Pro X', id: 634148309
mas 'Meeter', id: 1510445899
mas 'NepTunes', id: 1006739057
mas 'Numbers', id: 409203825
mas 'OmniFocus', id: 1346203938
mas 'Pages', id: 409201541
mas 'Pixelmator', id: 407963104
mas 'StopTheMadness', id: 1376402589
mas 'Time Out', id: 402592703
mas 'Xcode', id: 497799835
